In [3]:
import pandas as pd

In [4]:
companies = {
    'Value': [220,160,140,117,94],
    'Change': [17.5,11.9,-8.5,-2.1,3.5],
    'Sector': ['Ratail','Tech','Tech','Tech','Tech']
}
data = pd.DataFrame(companies, index =['Amazon', 'Google', 'Apple', 'Microsoft','Samsung'])
data

           Change  Sector  Value
Amazon       17.5  Ratail    220
Google       11.9    Tech    160
Apple        -8.5    Tech    140
Microsoft    -2.1    Tech    117
Samsung       3.5    Tech     94

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Amazon to Samsung
Data columns (total 3 columns):
Change    5 non-null float64
Sector    5 non-null object
Value     5 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

In [6]:
data.columns

Index(['Change', 'Sector', 'Value'], dtype='object')

In [7]:
data.index

Index(['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsung'], dtype='object')

In [8]:
data.describe()

          Change       Value
count   5.000000    5.000000
mean    4.460000  146.200000
std    10.456003   48.095738
min    -8.500000   94.000000
25%    -2.100000  117.000000
50%     3.500000  140.000000
75%    11.900000  160.000000
max    17.500000  220.000000

In [9]:
data.loc[data['Value'] >150]

        Change  Sector  Value
Amazon    17.5  Ratail    220
Google    11.9    Tech    160

In [10]:
data['Change']

Amazon       17.5
Google       11.9
Apple        -8.5
Microsoft    -2.1
Samsung       3.5
Name: Change, dtype: float64

In [11]:
data

           Change  Sector  Value
Amazon       17.5  Ratail    220
Google       11.9    Tech    160
Apple        -8.5    Tech    140
Microsoft    -2.1    Tech    117
Samsung       3.5    Tech     94

In [12]:
data.iloc[3]

Change    -2.1
Sector    Tech
Value      117
Name: Microsoft, dtype: object

In [13]:
data.iloc[1:4,1:3]

          Sector  Value
Google      Tech    160
Apple       Tech    140
Microsoft   Tech    117

In [14]:
data[0:3]

        Change  Sector  Value
Amazon    17.5  Ratail    220
Google    11.9    Tech    160
Apple     -8.5    Tech    140

In [15]:
data['Amazon':'Microsoft']

           Change  Sector  Value
Amazon       17.5  Ratail    220
Google       11.9    Tech    160
Apple        -8.5    Tech    140
Microsoft    -2.1    Tech    117

In [16]:
data

           Change  Sector  Value
Amazon       17.5  Ratail    220
Google       11.9    Tech    160
Apple        -8.5    Tech    140
Microsoft    -2.1    Tech    117
Samsung       3.5    Tech     94

In [17]:
data['Value'].mul(2)

Amazon       440
Google       320
Apple        280
Microsoft    234
Samsung      188
Name: Value, dtype: int64

In [19]:
data['Value'].sub(2)

Amazon       218
Google       158
Apple        138
Microsoft    115
Samsung       92
Name: Value, dtype: int64

In [20]:
data['Value'].add(2)

Amazon       222
Google       162
Apple        142
Microsoft    119
Samsung       96
Name: Value, dtype: int64

In [21]:
div, rem = divmod(data['Value'], 2)
div, rem

(Amazon       110
 Google        80
 Apple         70
 Microsoft     58
 Samsung       47
 Name: Value, dtype: int64, Amazon       0
 Google       0
 Apple        0
 Microsoft    1
 Samsung      0
 Name: Value, dtype: int64)

In [22]:
data

           Change  Sector  Value
Amazon       17.5  Ratail    220
Google       11.9    Tech    160
Apple        -8.5    Tech    140
Microsoft    -2.1    Tech    117
Samsung       3.5    Tech     94

In [23]:
data.mean()

Change      4.46
Value     146.20
dtype: float64

In [24]:
data.sum(0)

Change                      22.3
Sector    RatailTechTechTechTech
Value                        731
dtype: object

In [25]:
data.sum(1)

Amazon       237.5
Google       171.9
Apple        131.5
Microsoft    114.9
Samsung       97.5
dtype: float64

In [26]:
data.std()

Change    10.456003
Value     48.095738
dtype: float64

In [29]:
data.quantile(.5)

Change      3.5
Value     140.0
Name: 0.5, dtype: float64

In [30]:
data.min()

Change      -8.5
Sector    Ratail
Value         94
dtype: object

In [31]:
data.cumsum()

          Change                  Sector Value
Amazon      17.5                  Ratail   220
Google      29.4              RatailTech   380
Apple       20.9          RatailTechTech   520
Microsoft   18.8      RatailTechTechTech   637
Samsung     22.3  RatailTechTechTechTech   731